tutorials/blastXiFoam/deflagrationToDetonationTransition/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters .001;

L   6000;
W   300;
H   30;
nH  -30;

vertices
(
    (0  $nH 0)
    ($L $nH 0)
    ($L $H  0)
    (0  $H  0)
    (0  $nH $W)
    ($L $nH $W)
    ($L $H  $W)
    (0  $H  $W)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (3000 30 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 3 4 7)
            (1 2 6 5)
            (0 1 5 4)
            (3 2 6 7)
        );
    }
);

mergePatchPairs
(
);
