tutorials/blastXiFoam/deflagrationToDetonationTransition/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      HLLC;

ddtSchemes
{
    default         Euler;
    timeIntegrator  Euler;
}

gradSchemes
{
    default         cellMDLimited leastSquares 1.0;
}

divSchemes
{
    default             none;
    div(rhoPhi,epsilon) Gauss upwind;
    div(rhoPhi,k)       Gauss upwind;
    div(rhoPhi,omega)   Gauss upwind;
    div(rhoPhi,ft)      Gauss upwind;
    div(rhoPhi,b)       Gauss upwind;
    "div\(rhoPhi,tau.*\)" Gauss upwind;
    div(rhoPhi,Su)      Gauss upwind;

    div(phiXi,Xi)   Gauss limitedLinear 1;
    div(phiXi,Su)   Gauss limitedLinear 1;
    div(phiSt,b)    Gauss limitedLinear01 1;

    div(U)          Gauss linear;
    div((Su*n)) Gauss linear;
    div((U+((Su*Xi)*n))) Gauss linear;

    div(tauMC)          Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
    reconstruct(alpha)  Minmod;
    reconstruct(rho)    Minmod;
    reconstruct(U)      MinmodV;
    reconstruct(e)      Minmod;
    reconstruct(p)      Minmod;
    reconstruct(c)      Minmod;

    reconstruct(ft)     limitedLinear01 1;
    reconstruct(b)      limitedLinear01 1;

    "reconstruct(.*)"   Minmod;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
