tutorials/blastXiFoam/deflagrationToDetonationTransition/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellSet;
        action  clear;
    }
    {
        name    c0;
        type    cellSet;
        action  invert;
    }
    {
        name    c0;
        type    cellSet;
        action  delete;
        source  boxToCell;
        sourceInfo
        {
            boxes
            (
                (0.194 -0.03 0) (0.206 -0.02 0.30)
                (0.494 -0.03 0) (0.506 -0.02 0.30)
                (0.794 -0.03 0) (0.806 -0.02 0.30)
                (1.094 -0.03 0) (1.106 -0.02 0.30)
                (1.394 -0.03 0) (1.406 -0.02 0.30)
                (1.694 -0.03 0) (1.706 -0.02 0.30)
                (1.994 -0.03 0) (2.006 -0.02 0.30)

                (0.194 0.02 0) (0.206 0.03 0.30)
                (0.494 0.02 0) (0.506 0.03 0.30)
                (0.794 0.02 0) (0.806 0.03 0.30)
                (1.094 0.02 0) (1.106 0.03 0.30)
                (1.394 0.02 0) (1.406 0.03 0.30)
                (1.694 0.02 0) (1.706 0.03 0.30)
                (1.994 0.02 0) (2.006 0.03 0.30)
            );
        }
    }
);

// ************************************************************************* //
